Информационная_база_КанцОптТорг/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </attributes>
  <attributes>
    <name>Отсветственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база_КанцОптТорг/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база_КанцОптТорг/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количетво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база_КанцОптТорг/src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Информационная_база_КанцОптТорг/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РсчетныеСчета</name>
      <description>Рсчетные счета</description>
      <code>51</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>90.1</code>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
      <code>90.2</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>99</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Информационная_база_КанцОптТорг/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Отсветственный = ДанныеЗаполнения.Отсветственный;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество; 
		Движение.Выручка = ТекСтрокаТовары.Сумма; 
	КонецЦикла;

	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		
	КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		 |	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество
		 |ИЗ
		 |	РегистрНакопления.ОстаткиТоваров.Остатки(
		 |			,
		 |			Номенклатура В
		 |				(ВЫБРАТЬ
		 |					РеализацияТоваровТовары.Номенклатура КАК Номенклатура
		 |				ИЗ
		 |					Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		 |				ГДЕ
		 |					РеализацияТоваровТовары.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки
		 |ГДЕ
		 |	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Сообщить("Задание 12: В документе "+Ссылка+" образовались отрицательные остатки");
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
					Сообщить("Задание 12: По номенклатуре "+ВыборкаДетальныеЗаписи.Номенклатура+" остаток "+ВыборкаДетальныеЗаписи.Количество);	
				КонецЦикла;
		
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
			|	ОстаткиТоваровОстатки.СуммаОстаток КАК Сумма
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваров.Остатки(
			|			&МоментВремени,
			|			Номенклатура В
			|				(ВЫБРАТЬ
			|					РеализацияТоваровТовары.Номенклатура КАК Номенклатура
			|				ИЗ
			|					Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
			|				ГДЕ
			|					РеализацияТоваровТовары.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки";
		
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	СписаннаяСебестоимость = 0;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для каждого Движение Из Движения.ОстаткиТоваров Цикл
			
			Если Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура Тогда
				
				Движение.Сумма = Движение.Количество * ВыборкаДетальныеЗаписи.Сумма/ВыборкаДетальныеЗаписи.Количество;
				
				ДвижениеПродажи = Движения.Продажи.Добавить();
				ДвижениеПродажи.Период = Дата;
				ДвижениеПродажи.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				ДвижениеПродажи.Контрагент = Контрагент;
				ДвижениеПродажи.Сумма = Движение.Выручка;
				ДвижениеПродажи.Себестоимость = Движение.Сумма;
				ДвижениеПродажи.Количетво = Движение.Количество;
				
				СписаннаяСебестоимость =  СписаннаяСебестоимость + Движение.Сумма;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Движения.РегистрБухУчет.Записывать = Истина;
	
	Проводка = Движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчет.Себестоимость;
	Проводка.СчетКт = ПланыСчетов.БухУчет.Товары;
	Проводка.Сумма = СписаннаяСебестоимость;
	
	Проводка = Движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчет.РасчетыСПокупателями;
	Проводка.СчетКт = ПланыСчетов.БухУчет.Выручка;
	Проводка.Сумма = СуммаДокумента;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Контрагент.Клиент = Ложь Тогда 
					Отказ = Истина; 
		Сообщить("В документе должен быть выбран клиент!");
	КонецЕсли;
	
КонецПроцедуры
